# Ejercicios de Nivel Intermedio

In [37]:
# Importando Librerías
import pandas as pd
import numpy as np

1. Combinación de DataFrames:

Crea dos DataFrames y combínalos utilizando alguna función de combinación como merge o concat.

In [38]:
# Primer DataFrame
data1 = {
    'ID': [1, 2, 3, 4],
    'Nombre': ['Ana', 'Carlos', 'Eva', 'David'],
    'Edad': [25, 30, 22, 28]
}
df1 = pd.DataFrame(data1)

# Segundo DataFrame
data2 = {
    'ID': [3, 4, 5, 6],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Sevilla'],
    'Puntuacion': [85, 92, 78, 88]
}
df2 = pd.DataFrame(data2)
# Imprime los DataFrames
print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   ID  Nombre  Edad
0   1     Ana    25
1   2  Carlos    30
2   3     Eva    22
3   4   David    28

DataFrame 2:
   ID     Ciudad  Puntuacion
0   3     Madrid          85
1   4  Barcelona          92
2   5   Valencia          78
3   6    Sevilla          88

In [39]:
# Merge
merged = df1.merge(df2)
merged

   ID Nombre  Edad     Ciudad  Puntuacion
0   3    Eva    22     Madrid          85
1   4  David    28  Barcelona          92

In [40]:
# Join
joiner = df1.set_index('ID').join(df2.set_index('ID'), how='inner')
joiner

   Nombre  Edad     Ciudad  Puntuacion
ID
3     Eva    22     Madrid          85
4   David    28  Barcelona          92

In [41]:
# Concat
concatenado = pd.concat([df1, df2])
concatenado

   ID  Nombre  Edad     Ciudad  Puntuacion
0   1     Ana  25.0        NaN         NaN
1   2  Carlos  30.0        NaN         NaN
2   3     Eva  22.0        NaN         NaN
3   4   David  28.0        NaN         NaN
0   3     NaN   NaN     Madrid        85.0
1   4     NaN   NaN  Barcelona        92.0
2   5     NaN   NaN   Valencia        78.0
3   6     NaN   NaN    Sevilla        88.0

2. Manipulación de Fechas:

Si tienes una columna de fechas en tu DataFrame, realiza operaciones como encontrar la diferencia de días entre dos fechas o extraer el día de la semana.

In [42]:
# Crear un DataFrame de ejemplo con una columna de fechas
data = {'Fecha': ['2022-01-01', '2022-01-05', '2022-02-10', '2022-03-15']}
df = pd.DataFrame(data)
df['Fecha'] = pd.to_datetime(df['Fecha'])

# Imprimir el DataFrame original
print("DataFrame original:")
print(df)

# Encontrar la diferencia de días entre dos fechas
diferencia_dias = df['Fecha'].diff()
print("\nDiferencia de días entre fechas:")
print(diferencia_dias)

# Extraer el día de la semana
dia_semana = df['Fecha'].dt.day_name()
print("\nDía de la semana de cada fecha:")
print(dia_semana)

DataFrame original:
       Fecha
0 2022-01-01
1 2022-01-05
2 2022-02-10
3 2022-03-15

Diferencia de días entre fechas:
0       NaT
1    4 days
2   36 days
3   33 days
Name: Fecha, dtype: timedelta64[ns]

Día de la semana de cada fecha:
0     Saturday
1    Wednesday
2     Thursday
3      Tuesday
Name: Fecha, dtype: object

3. Manejo de Valores Nulos:

Introduce algunos valores nulos en tu DataFrame y practica cómo manejarlos, ya sea eliminándolos o llenándolos con valores específicos.

In [55]:
data = {'A': [1, 2, np.nan, 4],
        'B': [5, np.nan, np.nan, 8],
        'C': [9, 10, 11, 12]}
df = pd.DataFrame(data)
df

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11
3  4.0  8.0  12

In [52]:
df['A']=df['A'].fillna(0.0)
print(df)

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  0.0  NaN  11
3  4.0  8.0  12

In [59]:
df = df.dropna()
df

     A    B   C
0  1.0  5.0   9
3  4.0  8.0  12